Тест_ЗУП_31_КОРП/src/Catalogs/ВидыОперацийРасчетаЗарплаты/ВидыОперацийРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОперацийРасчетаЗарплаты</name>
  <attributes>
    <name>Начисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Договоры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пособия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Льготы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удержания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Займы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Взносы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/ВидыОперацийРасчетаЗарплаты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА КАК ЗначениеИстина
	               |ИЗ
	               |	Справочник.ВидыОперацийРасчетаЗарплаты КАК ВидыОперацийРасчетаЗарплаты";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ВидОперации = Справочники.ВидыОперацийРасчетаЗарплаты.СоздатьЭлемент();
	ВидОперации.Наименование = НСтр("ru = 'Расчет начислений'");
	ВидОперации.Начисление = Истина;
	ВидОперации.Договоры = Истина;
	ВидОперации.Пособия = Истина;
	ВидОперации.Льготы = Истина;
	ВидОперации.Записать();
	
	ВидОперации = Справочники.ВидыОперацийРасчетаЗарплаты.СоздатьЭлемент();
	ВидОперации.Наименование = НСтр("ru = 'Расчет удержаний'");
	ВидОперации.Удержания = Истина;
	ВидОперации.НДФЛ = Истина;
	ВидОперации.Займы = Истина;
	ВидОперации.Записать();
	
	ВидОперации = Справочники.ВидыОперацийРасчетаЗарплаты.СоздатьЭлемент();
	ВидОперации.Наименование = НСтр("ru = 'Начисление взносов'");
	ВидОперации.Взносы = Истина;
	ВидОперации.Записать();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
